{
  "_name_or_path": "aquib1011/maize-leaf-disease-convnext",
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    9,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "CommonRust",
    "1": "CornLeafBlight",
    "2": "GreyLeafSpot",
    "3": "NoFoliarSymptoms",
    "4": "PhaeosphaeriaLeafSpot",
    "5": "UnidentifiedDisease"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "CommonRust": 0,
    "CornLeafBlight": 1,
    "GreyLeafSpot": 2,
    "NoFoliarSymptoms": 3,
    "PhaeosphaeriaLeafSpot": 4,
    "UnidentifiedDisease": 5
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.41.1"
}
